import { getUnitByValue } from './getUnitByValue'

describe("getUnitByValue ['яблоко', 'яблока', 'яблок']", () => {
  const unit = ["яблоко", "яблока", "яблок"];

  test.each([
    [1, "яблоко"],
    [2, "яблока"],
    [3, "яблока"],
    [4, "яблока"],
    [5, "яблок"],
    [6, "яблок"],
    [7, "яблок"],
    [8, "яблок"],
    [9, "яблок"],
    [10, "яблок"],
    [11, "яблок"],
    [12, "яблок"],
    [13, "яблок"],
    [14, "яблок"],
    [15, "яблок"],
    [16, "яблок"],
    [17, "яблок"],
    [18, "яблок"],
    [19, "яблок"],
    [20, "яблок"],
    [21, "яблоко"],
    [22, "яблока"],
    [23, "яблока"],
    [24, "яблока"],
    [25, "яблок"],
    [100, "яблок"],
  ])('getUnitByValue(%i, [...])', (value, expected) => {
    expect(getUnitByValue(value, unit)).toBe(expected)
  });
})